<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f7583b859339ec7fa686e1dede26f102e2e52e987a971d5514b60786925e34dd","plan_job_ref":"Job Create terraform plan #20 at https://github.com/leonitousconforti/infra/actions/runs/15421168234","plan_out_hash":"6646baaa52a708dc6590ec8ac8782719c85def3936299bc8f3eb4bd03f91489a","plan_hash":"1b507a813ed53c3c82876b52e6aa2eb8c9748eeba601b4f5999697f7214b6e7d","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __ltgk.net__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_droplet.gateway_sfo3[0] will be created
+   resource "digitalocean_droplet" "gateway_sfo3" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.sfo3.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sfo3"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = "02e93d30-e1b7-4427-b017-74041b6c1ea1"
    }

  # digitalocean_droplet.gateway_sgp1[0] will be created
+   resource "digitalocean_droplet" "gateway_sgp1" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.sgp1.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "sgp1"
+       resize_disk          = true
+       size                 = "s-1vcpu-512mb-10gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = "a0cb15a3-3f0b-4f5c-a753-6e8c64d0128e"
    }

  # digitalocean_project_resources.ltgk_net_project_ams3_gateway will be created
+   resource "digitalocean_project_resources" "ltgk_net_project_ams3_gateway" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = [
+           "do:droplet:500052757",
        ]
    }

  # digitalocean_project_resources.ltgk_net_project_sfo3_gateway will be created
+   resource "digitalocean_project_resources" "ltgk_net_project_sfo3_gateway" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_project_resources.ltgk_net_project_sgp1_gateway will be created
+   resource "digitalocean_project_resources" "ltgk_net_project_sgp1_gateway" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_record.gateway_sfo3_AAAA_record will be created
+   resource "digitalocean_record" "gateway_sfo3_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sfo3"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_sfo3_A_record will be created
+   resource "digitalocean_record" "gateway_sfo3_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sfo3"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_sgp1_AAAA_record will be created
+   resource "digitalocean_record" "gateway_sgp1_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sgp1"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_sgp1_A_record will be created
+   resource "digitalocean_record" "gateway_sgp1_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.sgp1"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_reserved_ip.gateway_sfo3_reserved_ip will be created
+   resource "digitalocean_reserved_ip" "gateway_sfo3_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "sfo3"
+       urn        = (known after apply)
    }

  # digitalocean_reserved_ip.gateway_sgp1_reserved_ip will be created
+   resource "digitalocean_reserved_ip" "gateway_sgp1_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "sgp1"
+       urn        = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #20](https://github.com/leonitousconforti/infra/actions/runs/15421168234)